/* Non-user-facing error text for a connection that has been closed due to a timeout. */
"GCDAsyncSocketClosedError" = "Socket closed by remote peer";

/* Non-user-facing error text for an attempted connection that has failed due to a timeout. */
"GCDAsyncSocketConnectTimeoutError" = "Verbindungsversuch zum Host - Zeitlimit überschritten";

/* No comment provided by engineer. */
"GCDAsyncSocketOtherError" = "Attempt to create socket from socket FD failed. getpeername() failed";

/* Non-user-facing error text for a read operation that has read the maximum amount of allowed data. */
"GCDAsyncSocketReadMaxedOutError" = "Lesevorgang hat die vorgegebene Maximallänge erreicht";

/* Non-user-facing error text for a read operation that has failed due to a timeout. */
"GCDAsyncSocketReadTimeoutError" = "Lesevorgang - Zeitlimit erreicht";

/* Non-user-facing error text for a write operation that has failed due to a timeout. */
"GCDAsyncSocketWriteTimeoutError" = "Schreibvorgang - Zeitlimit erreicht";

